tutorials/multicomponentFluid/smallPoolFire2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite
runApplication $(getApplication)

#------------------------------------------------------------------------------
